Documents/ПланированиеАвансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПланированиеАвансов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияБазыРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланированиеАвансов/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланированиеАвансов.Ссылка
		|ИЗ
		|	Документ.ПланированиеАвансов КАК ПланированиеАвансов
		|ГДЕ
		|	ПланированиеАвансов.Дата >= &ДатаНач
		|	И ПланированиеАвансов.Дата <= &ДатаКон
		|	И ПланированиеАвансов.Организация = &Организация
		|	И ПланированиеАвансов.Здание = &Здание
		|	И ПланированиеАвансов.Услуга = &Услуга
		|	И НЕ ПланированиеАвансов.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Если РезультатЗапроса.Ссылка <> Ссылка Тогда
			Отказ = истина;	
		КонецЕсли;
	КонецЦикла;
	
	СуммаРаспределения = ЛицевыеСчета.Итог("СуммаНачислено");
	Если СуммаРаспределения <> СуммаДокумента Тогда
		ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить();			
		ТекстСообщения = НСтр("ru = 'Сумма документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не соответствует распределенной сумме в табличной части: %СуммаРаспределения% %ВалютаДенежныхСредств%! Распределите сумму документа повторно, либо измените ее на первоначальное значение.'; uk = 'Сума документа: %СуммаДокумента% %ВалютаДенежныхСредств%, не відповідає розподіленої сумі у табличній частині: %СуммаРаспределения% %ВалютаДенежныхСредств%! Розподіліть суму документу повторно, або змініть її на первинне значення.'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаДокумента%", Строка(СуммаДокумента));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаРаспределения%", Строка(СуммаРаспределения));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВалютаДенежныхСредств%", СокрЛП(Строка(ВалютаДенежныхСредств)));
		ОСМДСервер.СообщитьОбОшибке(
			ТекстСообщения,
			ЭтотОбъект,
			Отказ,
			"СуммаДокумента"
		);
	КонецЕсли;
	
КонецПроцедуры
